{
  "questions" : [
    {
      "question": "O tratamento dos dados é feito no âmbito de uma atividade situada em território da União Europeia?",
      "yes": "5",
      "no": "2",
      "type": 0,
      "text": ""
    },
    {
      "question": "O titular dos dados reside em território da União Europeia?",
      "yes": "3",
      "no": "4",
      "type": 0,
      "text": ""
    },
    {
      "question": "As atividades que motivam o tratamento dos dados estão relacionadas com ofertas de bens e serviços (independentemente da necessidade de pagamento) ou controlo de comportamento dentro da União Europeia?",
      "yes": "5",
      "no": "4",
      "type": 0,
      "text": ""
    },
    {
      "question": "O responsável pelo tratamento dos dados está situado num lugar onde se aplique o direito de um Estado-Membro da União Europeia por força do direito internacional?",
      "yes": "5",
      "no": "0",     
      "type": 0,
      "text": ""
    },
    {
      "question": "O tratamento dos dados é necessário para a prestação de um serviço?",
      "yes": "6",
      "no": "6",
      "type": 0,
      "text": "Autorizo que os meus dados pessoais sejam tratados de acordo com as condições acima descritas."
    },
    {
      "question": "É feito o tratamento de dados pessoais que revelem a origem racial ou ética, opiniões políticas, convicções religiosas ou filosóficas ou afiliação sindical, bem como dados genéricos, dados biométricos para identificação inequívoca, dados relativos à saúde ou à vida e orientação sexual de uma pessoa?",
      "yes": "7",
      "no": "8",
      "type": 0,
      "text": ""
    },
    {
      "question": "O tratamento destes dados está de acordo com algum dos casos apresentados abaixo:<ol><li>Para cumprimento de obrigações e do exercício de direitos específicos do responsável ou do titular em matéria de legislação laboral;</li><li>Para proteger interesses vitais do titular em caso de incapacidade</li><li>Efetuado no âmbito das atividades legítimas e mediante garantias por uma fundação, associação, ou qualquer outro organismo sem fins lucrativos e que prossiga fins políticos, filosóficos, religiosos, ou sindicais;</li><li>Refere-se a dados manifestadamente tornados públicos pelo titular;</li><li>É necessário à declaração, exercício ou defesa de um direito num processo judicial;</li><li>É necessário por motivos de interesse público com base no direito de um Estado-Membro;</li><li>É necessário para efeitos de medicina preventiva ou do trabalho;</li><li>É necessário por motivos de interesse público no domínio da saúde pública;</li><li>É necessário para fins de arquivo de interesse público, de investigação científica ou histórica ou para fins estatísticos;</li><li>Qualquer outro caso apresentado no Artigo 9º do Regulamento.</li></ol>",
      "yes": "8",
      "no": "8",
      "type": 0,
      "text": "Os dados pessoais são recolhidos em conformidade com o Artigo 9º do Regulamento Geral de Dados."
    },
    {
      "question": "Introduza uma descrição da finalidade do tratamento dos dados. Exemplo: 'Os dados recolhidos são utilizados para [introduzir finalidade]'",
      "yes": "9",
      "no": "9",
      "type": 1,
      "text": "O responsável pelo tratamento dos dados compomete-se a aplicar as medidas técnicas e organizativas adequadas para assegurar e comprovar que o tratamento é realizado em conformidade com o RGPD, e a rever e atualizar essas medidas consoante as necessidades. O responsável compromete-se também a aplicar as medidas técnicas e organizativas para assegurar um nível de segurança adequado ao risco para os direitos e liberdades do titular dos dados, consoante o apresentado no Artigo 32º do Regulamento. Quando a violação dos dados pessoais for suscetível de implicar um elevado risco para os direitos e liberdades das pessoas singulares, e de acordo com o Artigo 34º do Regulamento, o responsável pelo tratamento compromete-se a comunicar a violação de dados pessoais ao titular dos dados sem demora injustificada."
    },
    {
      "question": "Introduza o nome do responsável pelo tratamento dos dados, ou do seu representante, juntamente com pelo menos um meio de contacto (email e/ou telefone).",
      "yes": "10",
      "no": "10",
      "type": 1,
      "text": ""
    },
    {
      "question": "Os dados vão ser tratados para efeito de comercialização direta?",
      "yes": "11",
      "no": "11",
      "type": 0,
      "text": "O titular tem o direito de se opor ao tratamento de dados para efeitos de comercialização direta, incluindo a definição de perfis, de acordo com o Artigo 21º, nº2."
    },
    {
      "question": "Os dados vão ser sujeitos a tratamento automatizado?",
      "yes": "12",
      "no": "12",
      "type": 0,
      "text": "De acordo com o Artigo 22º, o titular dos dados tem o direito de não ficar sujeito a nenhuma decisão tomada exclusivamente com base no tratamento automatizado, incluindo a definição de perfis, que produza efeito na sua esfera jurídica ou que o afete de forma semelhante."
    },
    {
      "question": "Os dados pessoais sujeitos a tratamento constam de documentos oficiais na pose de uma autoridade pública ou de um organismo público ou privado para a prossecução de atribuições de interesse público?",
      "yes": "0",
      "no": "0",
      "type": 0,
      "text": "Os dados pessoais que constem de documentos oficiais na posse de uma autoridade pública ou de um organismo público ou privado para a prossecução de atribuições de interesse público podem ser divulgados pela autoridade ou organismo a fim de conciliar o acesso do público a documentos oficiais com o direito à proteção dos dados pessoais nos termos do presente regulamento."
    }
  ]
}